## Production: alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 46 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.wordpress_canary will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "wordpress_canary"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                "use strict";
                
                const { URL } = require("url");
                const synthetics = require("Synthetics");
                const log = require("SyntheticsLogger");
                const syntheticsConfiguration = synthetics.getConfiguration();
                
                /**
                 * Main handler for the healthcheck canary.  Loops over the `const urls` 
                 * and attempts to load the given page in Puppeteer.  Any HTTP resonse
                 * code outside of the 200 range is considered a failure.
                 */
                const handler = async function () {
                
                    syntheticsConfiguration.disableStepScreenshots();
                    syntheticsConfiguration.setConfig({
                       continueOnStepFailure: true
                    });
                 
                    let page = await synthetics.getPage();
                    
                    for (const url of urls) {
                        await executeStep(page, url);
                    }
                };
                
                /**
                 * Parses the given url and executes the canary step.
                 * @param {Object} page Puppeteer page object
                 * @param {String} url URL to load
                 */
                const executeStep = async function (page, url) {
                    let stepName = null;
                 
                    try {
                        stepName = new URL(url).hostname;
                    } catch (error) {
                        log.error(`Error parsing url: ${url}.  ${error}`);
                        throw error;
                    }
                    
                    await synthetics.executeStep(stepName, async function () {
                        await gotoUrl(page, url);
                    });
                };
                
                /**
                 * Attempts to load the given URL.  HTTP response code must be in the 200 range
                 * to be considered a success.
                 * @param {Object} page Puppeteer page object 
                 * @param {String} url URL to load
                 */
                const gotoUrl = async function (page, url) {
                    const response = await page.goto(url, { waitUntil: ["domcontentloaded"], timeout: 30000});
                    if (response) {
                        const status = response.status();
                        const statusText = response.statusText(); 
                        if (status < 200 || status > 299) {
                            throw new Error(`Failed to load url: ${url} ${status} ${statusText}`); 
                        }
                    } else {
                        const logNoResponseString = `No response returned for url: ${url}`;
                        log.error(logNoResponseString);
                        throw new Error(logNoResponseString);
                    }
                }
                
                const urls = [
                    "https://articles.alpha.canada.ca/", 
                    "https://articles.alpha.canada.ca/"
                ];
                 
                exports.handler = async () => {
                    return await handler();
                };
                exports.executeStep = executeStep;
                exports.gotoUrl = gotoUrl;
            EOT
          + filename = "nodejs/node_modules/healthcheck.js"
        }
    }

  # data.aws_iam_policy_document.synthetic_canary_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "synthetic_canary_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:ca-central-1:472286471787:log-group:/aws/lambda/cwsyn-wordpress-healthcheck-*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListAllMyBuckets",
              + "xray:PutTraceSegments",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "CloudWatchSynthetics",
                ]
              + variable = "cloudwatch:namespace"
            }
        }
    }

  # aws_cloudwatch_log_metric_filter.wordpress_ecs_warn_error_event will be created
  + resource "aws_cloudwatch_log_metric_filter" "wordpress_ecs_warn_error_event" {
      + id             = (known after apply)
      + log_group_name = "/aws/lambda/ecs_events"
      + name           = "WordPressEcsWarningEvent"
      + pattern        = "?Warn ?Error"

      + metric_transformation {
          + default_value = "0"
          + name          = "WordPressEcsWarnErrorEvent"
          + namespace     = "WordPress"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.wordpress_failed_login will be created
  + resource "aws_cloudwatch_log_metric_filter" "wordpress_failed_login" {
      + id             = (known after apply)
      + log_group_name = "/aws/ecs/wordpress"
      + name           = "WordPressFailedLogin"
      + pattern        = "LOGIN FAILED"

      + metric_transformation {
          + default_value = "0"
          + name          = "WordPressFailedLogin"
          + namespace     = "WordPress"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.alb_ddos will be created
  + resource "aws_cloudwatch_metric_alarm" "alb_ddos" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "DDoS detection for ALB"
      + alarm_name                            = "ALBDDoS"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ResourceArn" = "arn:aws:elasticloadbalancing:ca-central-1:472286471787:loadbalancer/app/wordpress/e5390715eaeedd67"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DDoSDetected"
      + namespace                             = "AWS/DDoSProtection"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.alb_target_4xx_response will be created
  + resource "aws_cloudwatch_metric_alarm" "alb_target_4xx_response" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Sum of 4xx response from the ALB target group in a 5 minute period"
      + alarm_name                            = "ALBTargetGroup4xxResponse"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "app/wordpress/e5390715eaeedd67"
          + "TargetGroup"  = "targetgroup/wp20211214191200517600000002/929a0df653b27d44"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_Target_4XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.alb_target_5xx_response will be created
  + resource "aws_cloudwatch_metric_alarm" "alb_target_5xx_response" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Sum of 5xx response from the ALB target group in a 5 minute period"
      + alarm_name                            = "ALBTargetGroup5xxResponse"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "app/wordpress/e5390715eaeedd67"
          + "TargetGroup"  = "targetgroup/wp20211214191200517600000002/929a0df653b27d44"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_Target_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.alb_target_response_time_average will be created
  + resource "aws_cloudwatch_metric_alarm" "alb_target_response_time_average" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Average response time (seconds) for the ALB target group to receive a response in a 5 minute period"
      + alarm_name                            = "ALBTargetGroupResponseTimeAverage"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "app/wordpress/e5390715eaeedd67"
          + "TargetGroup"  = "targetgroup/wp20211214191200517600000002/929a0df653b27d44"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 2
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.alb_target_unhealthy_host will be created
  + resource "aws_cloudwatch_metric_alarm" "alb_target_unhealthy_host" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Unhealthy ALB target group hosts in a 5 minute period"
      + alarm_name                            = "ALBTargetUnhealthyHost"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "LoadBalancer" = "app/wordpress/e5390715eaeedd67"
          + "TargetGroup"  = "targetgroup/wp20211214191200517600000002/929a0df653b27d44"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.cloudfront_4xx_response will be created
  + resource "aws_cloudwatch_metric_alarm" "cloudfront_4xx_response" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Monitors for high CloudFront 4xx responses in a 5 minute period"
      + alarm_name                            = "CloudFront4xxResponse"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DistributionId" = "E1HX1N6D5W92G9"
          + "Region"         = "Global"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "4xxErrorRate"
      + namespace                             = "AWS/CloudFront"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.cloudfront_ddos will be created
  + resource "aws_cloudwatch_metric_alarm" "cloudfront_ddos" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "DDoS detection for CloudFront"
      + alarm_name                            = "CloudFrontDDoS"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ResourceArn" = "arn:aws:cloudfront::472286471787:distribution/E1HX1N6D5W92G9"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DDoSDetected"
      + namespace                             = "AWS/DDoSProtection"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.cloudfront_waf_blocked_requests_percent will be created
  + resource "aws_cloudwatch_metric_alarm" "cloudfront_waf_blocked_requests_percent" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "More than 50% of requests being blocked in 5 minute period"
      + alarm_name                            = "WAFBlockedRequestsPercent"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "allowed"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "Rule"   = "ALL"
                  + "WebACL" = "wordpress_waf"
                }
              + metric_name = "AllowedRequests"
              + namespace   = "AWS/WAFV2"
              + period      = 300
              + stat        = "Sum"
            }
        }
      + metric_query {
          + id          = "blocked"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "Rule"   = "ALL"
                  + "WebACL" = "wordpress_waf"
                }
              + metric_name = "BlockedRequests"
              + namespace   = "AWS/WAFV2"
              + period      = 300
              + stat        = "Sum"
            }
        }
      + metric_query {
          + expression  = "100*blocked/(blocked+allowed)"
          + id          = "blocked_request_percent"
          + label       = "WAF blocked requests percent"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.ecs_cpu_utilization will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_cpu_utilization" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "High ECS CPU utilization over 4 minutes"
      + alarm_name                            = "ECSCpuUtilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "wordpress"
          + "ServiceName" = "wordpress"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 120
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.ecs_memory_utilization will be created
  + resource "aws_cloudwatch_metric_alarm" "ecs_memory_utilization" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "High Wordpress ECS memory utilization over 4 minutes"
      + alarm_name                            = "ECSMemoryUtilization"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "wordpress"
          + "ServiceName" = "wordpress"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "MemoryUtilization"
      + namespace                             = "AWS/ECS"
      + ok_actions                            = (known after apply)
      + period                                = 120
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 50
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.rds_aurora_replica_lag will be created
  + resource "aws_cloudwatch_metric_alarm" "rds_aurora_replica_lag" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Replica lag (milliseconds) for RDS cluster reader in a 5 minute period"
      + alarm_name                            = "RdsAuroraReplicaLag"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBClusterIdentifier" = "wordpress-cluster"
          + "Role"                = "READER"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "AuroraReplicaLag"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 2000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.rds_cpu_utilization_reader will be created
  + resource "aws_cloudwatch_metric_alarm" "rds_cpu_utilization_reader" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "CPU utilization for RDS cluster reader in a 5 minute period"
      + alarm_name                            = "RDSCpuUtilizationReader"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBClusterIdentifier" = "wordpress-cluster"
          + "Role"                = "READER"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.rds_cpu_utilization_writer will be created
  + resource "aws_cloudwatch_metric_alarm" "rds_cpu_utilization_writer" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "CPU utilization for RDS cluster writer in a 5 minute period"
      + alarm_name                            = "RDSCpuUtilizationWriter"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBClusterIdentifier" = "wordpress-cluster"
          + "Role"                = "WRITER"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.rds_freeable_memory_reader will be created
  + resource "aws_cloudwatch_metric_alarm" "rds_freeable_memory_reader" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Freeable memory (Bytes) for RDS cluster reader in a 5 minute period"
      + alarm_name                            = "RdsFreeableMemoryReader"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBClusterIdentifier" = "wordpress-cluster"
          + "Role"                = "READER"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FreeableMemory"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Minimum"
      + tags_all                              = (known after apply)
      + threshold                             = 64000000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.rds_freeable_memory_writer will be created
  + resource "aws_cloudwatch_metric_alarm" "rds_freeable_memory_writer" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Minimum freeable memory (Bytes) for RDS cluster writer in a 5 minute period"
      + alarm_name                            = "RdsFreeableMemoryWriter"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBClusterIdentifier" = "wordpress-cluster"
          + "Role"                = "WRITER"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FreeableMemory"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Minimum"
      + tags_all                              = (known after apply)
      + threshold                             = 64000000
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.route53_ddos will be created
  + resource "aws_cloudwatch_metric_alarm" "route53_ddos" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "DDoS detection for Route53"
      + alarm_name                            = "Route53DDoS"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ResourceArn" = "arn:aws:route53:::hostedzone/Z047184324K1AE3EY5D2D"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DDoSDetected"
      + namespace                             = "AWS/DDoSProtection"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.wordpress_canary_healthcheck will be created
  + resource "aws_cloudwatch_metric_alarm" "wordpress_canary_healthcheck" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Monitors for failing synthetic canary health checks"
      + alarm_name                            = "CanaryHealthCheck"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "CanaryName" = "wordpress-healthcheck"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "SuccessPercent"
      + namespace                             = "CloudWatchSynthetics"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Minimum"
      + tags_all                              = (known after apply)
      + threshold                             = 100
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.wordpress_ecs_warn_error_event will be created
  + resource "aws_cloudwatch_metric_alarm" "wordpress_ecs_warn_error_event" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "WordPress ECS warning or error event detected"
      + alarm_name                            = "WordPressEcsWarnErrorEvent"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "WordPressEcsWarningEvent"
      + namespace                             = "WordPress"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.wordpress_failed_login will be created
  + resource "aws_cloudwatch_metric_alarm" "wordpress_failed_login" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "High number of failed Wordpress login attempts in a 1 minute period"
      + alarm_name                            = "WordPressFailedLogin"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "WordPressFailedLogin"
      + namespace                             = "WordPress"
      + ok_actions                            = (known after apply)
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 5
      + treat_missing_data                    = "missing"
    }

  # aws_iam_policy.synthetic_canary_policy will be created
  + resource "aws_iam_policy" "synthetic_canary_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "SyntheticCanaryPolicy"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.synthetic_canary_execution_role will be created
  + resource "aws_iam_role" "synthetic_canary_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SyntheticCanaryExecutionRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.synthetic_canary_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "synthetic_canary_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "SyntheticCanaryExecutionRole"
    }

  # aws_kms_key.sns_cloudwatch will be created
  + resource "aws_kms_key" "sns_cloudwatch" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for CloudWatch SNS topic"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::472286471787:root"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all                           = {
          + "CostCentre" = "PlatformGCArticles"
        }
    }

  # aws_kms_key.sns_cloudwatch_us_east will be created
  + resource "aws_kms_key" "sns_cloudwatch_us_east" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for CloudWatch SNS topic in US east"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::472286471787:root"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                          + "kms:Decrypt",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudwatch.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                               = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all                           = {
          + "CostCentre" = "PlatformGCArticles"
        }
    }

  # aws_s3_bucket.synthetic_artifacts will be created
  + resource "aws_s3_bucket" "synthetic_artifacts" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "platform-mvp-synthetic-canary-production"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 31
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_public_access_block.synthetic_artifacts will be created
  + resource "aws_s3_bucket_public_access_block" "synthetic_artifacts" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_shield_protection.alb will be created
  + resource "aws_shield_protection" "alb" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "LoadBalancer"
      + resource_arn = "arn:aws:elasticloadbalancing:ca-central-1:472286471787:loadbalancer/app/wordpress/e5390715eaeedd67"
      + tags         = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all     = {
          + "CostCentre" = "PlatformGCArticles"
        }
    }

  # aws_shield_protection.cloudfront will be created
  + resource "aws_shield_protection" "cloudfront" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "CloudFront"
      + resource_arn = "arn:aws:cloudfront::472286471787:distribution/E1HX1N6D5W92G9"
      + tags         = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all     = {
          + "CostCentre" = "PlatformGCArticles"
        }
    }

  # aws_shield_protection.route53_hosted_zone will be created
  + resource "aws_shield_protection" "route53_hosted_zone" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "Route53HostedZone"
      + resource_arn = "arn:aws:route53:::hostedzone/Z047184324K1AE3EY5D2D"
      + tags         = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all     = {
          + "CostCentre" = "PlatformGCArticles"
        }
    }

  # aws_sns_topic.alert_observe will be created
  + resource "aws_sns_topic" "alert_observe" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "alert-observe"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all                    = {
          + "CostCentre" = "PlatformGCArticles"
        }
    }

  # aws_sns_topic.alert_observe_us_east will be created
  + resource "aws_sns_topic" "alert_observe_us_east" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "alert-observe"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all                    = {
          + "CostCentre" = "PlatformGCArticles"
        }
    }

  # aws_sns_topic.alert_warning will be created
  + resource "aws_sns_topic" "alert_warning" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "alert-warning"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all                    = {
          + "CostCentre" = "PlatformGCArticles"
        }
    }

  # aws_sns_topic.alert_warning_us_east will be created
  + resource "aws_sns_topic" "alert_warning_us_east" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + kms_master_key_id           = (known after apply)
      + name                        = "alert-warning"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags                        = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all                    = {
          + "CostCentre" = "PlatformGCArticles"
        }
    }

  # aws_sns_topic_subscription.alert_warning will be created
  + resource "aws_sns_topic_subscription" "alert_warning" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_sns_topic_subscription.alert_warning_us_east will be created
  + resource "aws_sns_topic_subscription" "alert_warning_us_east" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # aws_synthetics_canary.wordpress will be created
  + resource "aws_synthetics_canary" "wordpress" {
      + arn                      = (known after apply)
      + artifact_s3_location     = (known after apply)
      + engine_arn               = (known after apply)
      + execution_role_arn       = (known after apply)
      + failure_retention_period = 31
      + handler                  = "healthcheck.handler"
      + id                       = (known after apply)
      + name                     = "wordpress-healthcheck"
      + runtime_version          = "syn-nodejs-puppeteer-3.1"
      + source_location_arn      = (known after apply)
      + start_canary             = true
      + status                   = (known after apply)
      + success_retention_period = 31
      + tags_all                 = (known after apply)
      + timeline                 = (known after apply)
      + zip_file                 = (known after apply)

      + run_config {
          + active_tracing     = (known after apply)
          + memory_in_mb       = (known after apply)
          + timeout_in_seconds = (known after apply)
        }

      + schedule {
          + expression = "rate(5 minutes)"
        }
    }

  # random_uuid.wordpress_canary will be created
  + resource "random_uuid" "wordpress_canary" {
      + id      = (known after apply)
      + keepers = {
          + "template" = "ddd9448b0babe964ae3f5468941619dc3e3917075415f86a43cbc5baa3aebd88"
        }
      + result  = (known after apply)
    }

  # module.notify_slack.data.aws_iam_policy_document.notify_slack_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "notify_slack_lambda"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.notify_slack.aws_cloudwatch_log_group.notify_slack_lambda will be created
  + resource "aws_cloudwatch_log_group" "notify_slack_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/notify_slack"
      + retention_in_days = 14
      + tags              = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all          = {
          + "CostCentre" = "PlatformGCArticles"
        }
    }

  # module.notify_slack.aws_iam_policy.notify_slack_lambda will be created
  + resource "aws_iam_policy" "notify_slack_lambda" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "NotifySlackLambda-notify_slack"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.notify_slack.aws_iam_role.notify_slack_lambda will be created
  + resource "aws_iam_role" "notify_slack_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "NotifySlackLambda-notify_slack"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.notify_slack.aws_iam_role_policy_attachment.notify_slack_lambda will be created
  + resource "aws_iam_role_policy_attachment" "notify_slack_lambda" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "NotifySlackLambda-notify_slack"
    }

  # module.notify_slack.aws_lambda_function.notify_slack will be created
  + resource "aws_lambda_function" "notify_slack" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Lambda function to post CloudWatch alarm notifications to a Slack channel."
      + filename                       = "/tmp/notify_slack.py.zip"
      + function_name                  = "notify_slack"
      + handler                        = "notify_slack.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "FipuaAUTHLWpYfowItg9o9BtNFUGbGVXXpLMyzFzTZY="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all                       = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "LOG_EVENTS"        = "True"
              + "PROJECT_NAME"      = "WordPress"
              + "SLACK_WEBHOOK_URL" = (sensitive)
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.notify_slack.aws_lambda_permission.notify_slack[0] will be created
  + resource "aws_lambda_permission" "notify_slack" {
      + action        = "lambda:InvokeFunction"
      + function_name = "notify_slack"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromSNS-notify_slack-0"
    }

  # module.notify_slack.aws_lambda_permission.notify_slack[1] will be created
  + resource "aws_lambda_permission" "notify_slack" {
      + action        = "lambda:InvokeFunction"
      + function_name = "notify_slack"
      + id            = (known after apply)
      + principal     = "sns.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromSNS-notify_slack-1"
    }

Plan: 46 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>